// Завдання 1
// Напишіть функцію getArea(number), яка обчислює площу круга. Для визначення площі використовуйте Math. В залежності від того що передали в функцію має виводити наступні повідомлення:
// Якщо передане число повертати - Площа дорівнює стільки то квадратних одиниць.
// Якщо передали не число - Повинно бути числове значення.
// Якщо в функцію нічого не передали - Будь ласка, введіть радіус!
// ------------------------------------------------------------------------------------------


let re = prompt('Вкажіть число');
function getArea (radius) {
    if(radius === null ||radius === ' '){
        console.log('Введіть радіус');
    }else if(isNaN(+radius)) {
        console.log('Ви ввели не числове значення');
    }else if(!isNaN(+radius)){
        console.log('Площа дорівнює' + 2 *  Math.PI * number(radius));
    }
}
getMath(re)
console.log(getMath(re));